tests/data/pgbench_pd_5.txt
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2646
number of failed transactions: 0 (0.000%)
latency average = 227.627 ms
average connection time = 47.865 ms
tps = 43.931555 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        11.139           0  BEGIN;
        11.886           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        11.501           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        44.784           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
        77.463           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        11.296           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.418           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 30
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2325
number of failed transactions: 0 (0.000%)
latency average = 783.398 ms
average connection time = 46.175 ms
tps = 38.294714 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        12.236           0  BEGIN;
        15.374           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        13.577           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
       483.594           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       184.531           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        12.995           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        10.710           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 50
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2054
number of failed transactions: 0 (0.000%)
latency average = 1489.802 ms
average connection time = 47.407 ms
tps = 33.561499 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        13.663           0  BEGIN;
        16.855           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        14.656           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
      1127.937           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       228.419           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        15.248           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.196           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 100
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2079
number of failed transactions: 0 (0.000%)
latency average = 3007.346 ms
average connection time = 47.183 ms
tps = 33.251906 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        22.628           0  BEGIN;
        19.231           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        14.695           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
      2556.919           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       248.846           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        15.711           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.211           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 300
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2193
number of failed transactions: 0 (0.000%)
latency average = 9141.501 ms
average connection time = 49.077 ms
tps = 32.817369 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
       113.122           0  BEGIN;
        25.801           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        15.615           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
      8095.247           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       254.779           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        14.560           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.284           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 500
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2390
number of failed transactions: 0 (0.000%)
latency average = 14988.488 ms
average connection time = 50.281 ms
tps = 33.358935 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
       304.658           0  BEGIN;
        98.652           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        17.554           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
     12718.341           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       252.719           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        13.641           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.817           0  END;